In [86]:
import pandas as pd
df = pd.read_csv("C:\\Users\Ibad\Desktop\Liver.csv")
df.head()

   age  gender    TB   DB  alkphos  sgpt   sgot   TP  ALB   A_G  class
0   65  Female   0.7  0.1    187.0  16.0   18.0  6.8  3.3  0.90    1.0
1   62    Male  10.9  5.5    699.0  64.0  100.0  7.5  3.2  0.74    1.0
2   62    Male   7.3  4.1    490.0  60.0   68.0  7.0  3.3  0.89    1.0
3   58    Male   1.0  0.4    182.0  14.0   20.0  6.8  3.4  1.00    1.0
4   72    Male   3.9  2.0    195.0  27.0   59.0  7.3  2.4  0.40    1.0

In [87]:
target = df['class']
inputs = df.drop('class', axis='columns')
inputs.head()

   age  gender    TB   DB  alkphos  sgpt   sgot   TP  ALB   A_G
0   65  Female   0.7  0.1    187.0  16.0   18.0  6.8  3.3  0.90
1   62    Male  10.9  5.5    699.0  64.0  100.0  7.5  3.2  0.74
2   62    Male   7.3  4.1    490.0  60.0   68.0  7.0  3.3  0.89
3   58    Male   1.0  0.4    182.0  14.0   20.0  6.8  3.4  1.00
4   72    Male   3.9  2.0    195.0  27.0   59.0  7.3  2.4  0.40

In [88]:
dummies = pd.get_dummies(df.gender)
dummies.head()

   Female  Male
0       1     0
1       0     1
2       0     1
3       0     1
4       0     1

In [89]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head()

   age  gender    TB   DB  alkphos  sgpt   sgot   TP  ALB   A_G  Female  Male
0   65  Female   0.7  0.1    187.0  16.0   18.0  6.8  3.3  0.90       1     0
1   62    Male  10.9  5.5    699.0  64.0  100.0  7.5  3.2  0.74       0     1
2   62    Male   7.3  4.1    490.0  60.0   68.0  7.0  3.3  0.89       0     1
3   58    Male   1.0  0.4    182.0  14.0   20.0  6.8  3.4  1.00       0     1
4   72    Male   3.9  2.0    195.0  27.0   59.0  7.3  2.4  0.40       0     1

In [90]:
inputs.drop('gender', axis= 'columns', inplace= True)
inputs.head()

   age    TB   DB  alkphos  sgpt   sgot   TP  ALB   A_G  Female  Male
0   65   0.7  0.1    187.0  16.0   18.0  6.8  3.3  0.90       1     0
1   62  10.9  5.5    699.0  64.0  100.0  7.5  3.2  0.74       0     1
2   62   7.3  4.1    490.0  60.0   68.0  7.0  3.3  0.89       0     1
3   58   1.0  0.4    182.0  14.0   20.0  6.8  3.4  1.00       0     1
4   72   3.9  2.0    195.0  27.0   59.0  7.3  2.4  0.40       0     1

In [91]:
inputs.columns[inputs.isna().any()]  #checking any nan values in columns

Index([], dtype='object')

In [92]:
inputs.isna().any()   #checking any nan values in columns

age        False
TB         False
DB         False
alkphos    False
sgpt       False
sgot       False
TP         False
ALB        False
A_G        False
Female     False
Male       False
dtype: bool

In [111]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split(inputs, target, test_size=0.2)

In [112]:
len(X_train)

466

In [113]:
len(X_test)

117

In [114]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [115]:
model.fit(X_train,Y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [116]:
model.score(X_test,Y_test)

0.5897435897435898

In [117]:
Y_test[:10]

515    1.0
78     2.0
143    1.0
496    1.0
33     2.0
260    1.0
526    1.0
50     1.0
477    1.0
555    1.0
Name: class, dtype: float64

In [118]:
model.predict(X_test[:10])

array([1., 2., 2., 2., 2., 1., 1., 2., 2., 1.])